app/controllers/movies_controller.rb

  def index
    if params[:commit] == 'Refresh'
          session[:ratings] = params[:ratings]
    elsif session[:ratings] != params[:ratings]
          redirect = true
          params[:ratings] = session[:ratings]
    end

    if params[:order]
          session[:order] = params[:order]
    elsif session[:order]
          redirect = true
          params[:order] = session[:order]
    end
    @ratings, @order = session[:ratings], session[:order]
    if redirect
        redirect_to movies_path({:order=>@order, :ratings=>@ratings})
    end
    @all_ratings= Movie.all_ratings
    @selected_ratings= params[:ratings] ? params[:ratings].keys : @all_ratings
    @movies= Movie.where({rating:  @selected_ratings}).order(params[:order])
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date