app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    case params[:sort]
    when "by_title"
      @movies = Movie.all(:order => "title")